<html>
<head>
<title>Yamwi</title>
</head>

<body>

<p align="right"><a href="index_es.html">Espa&ntilde;ol</a> <a href="index.html">English</a></p>


<center>
<h1>Yamwi</h1>
</center>



<p>
Yamwi (<i>Yet Another Maxima Web Interface</i>) &eacute; un proxecto consistente no desenrolo dun interface <i>web</i> &oacute; <i>Sistema de C&aacute;lculo Simb&oacute;lico</i> Maxima. Dito interface material&iacute;zase nun <i>script</i> escrito en <i>php</i>.
</p>

<p>
A instalaci&oacute;n deste interface permitir&aacute; o acceso a procedementos matem&aacute;ticos e gr&aacute;ficos a trav&eacute;s da rede, tanto no eido do ensino como profesional.
</p>

<p>
Yamwi distrib&uacute;ese con licencia GNU-GPL.
</p>


<hr>

<h2>Que &eacute; Maxima-CAS?</h2>

<p>
Maxima &eacute; un sistema para manipular expresi&oacute;ns simb&oacute;licas e num&eacute;ricas, incluidas a derivaci&oacute;n, integraci&oacute;n, desenrolos de Taylor, transformadas de Laplace, ecuaci&oacute;ns diferenciais ordinarias, sistemas de ecuaci&oacute;ns lineais, polinomios, conxuntos, listas, matrices e tensores. Maxima acada resultados num&eacute;ricos de alta precisi&oacute;n utilizando fracci&oacute;ns exactas, enteiros e n&uacute;meros decimais de precisi&oacute;n arbitraria. Maxima pode debuxar funci&oacute;ns e datos en d&uacute;as e tres dimensi&oacute;ns, as&iacute; como compo&ntilde;er animaci&oacute;ns.
</p>

<h2>Cal &eacute; a historia de Maxima?</h2>

<p>
Maxima descende de Macsyma, o lexendario programa de c&aacute;lculo simb&oacute;lico desenvolvido a finais dos sesenta no Instituto Tecnol&oacute;xico de Massachusetts. Macsyma foi revolucionario no seu momento, e moitos outros sistemas, como Maple e Mathematica, inspir&aacute;ronse nel.
</p>

<p>
A p&oacute;la de Macsyma que leva o nome de Maxima foi mantida por William Schelter dende 1982 ata o seu pasamento en 2001. En 1998 obtivo permiso do <i>Departamento de Enerx&iacute;a</i> para liberar o c&oacute;digo con licenza GNU General Public License (GPL). Foron os sus esforzos e co&ntilde;ecementos os que fixeron posible que Maxima sobrevivise.
</p>


<h2>Que se necesita para facer funcionar Maxima?</h2>

<p>
Maxima traballa sobre Linux, Mac e Windows. Anque o proxecto centra a s&uacute;a atenci&oacute;n no motor matem&aacute;tico, outros proxectos, varios deles aloxados tam&eacute;n en Sourceforge, ad&iacute;canse &oacute; desenvolvemento de interfaces gr&aacute;ficas de usuario. Dende a p&aacute;xina do proxecto se pode atopar toda a informaci&oacute;n e os ficheiros necesarios.
</p>

<p>
Algunhas capturas de pantalla de Maxima traballando sobre varios contornos:
<ul>
<li><a href="texto.jpg">Texto</a></li>
<li><a href="xmaxima.jpg">Xmaxima</a></li>
<li><a href="texmacs.jpg">Texmacs</a></li>
<li><a href="wxmaxima.jpg">Wxmaxima</a></li>
</ul>
</p>

<h2>Onde hai informaci&oacute;n sobre Maxima?</h2>

<ul>
<li><a href="http://maxima.sourceforge.net">P&aacute;xina oficial do proxecto</a></li>
<li><a href="http://sourceforge.net/projects/maxima/">P&aacute;xina de Maxima en Sourceforge</a></li>
<li><a href="http://sourceforge.net/project/showfiles.php?group_id=4933">C&oacute;digo fonte e binarios</a></li>
<li><a href="http://maxima.sourceforge.net/docs/manual/es/maxima.html">Manual de referencia en espa&ntilde;ol (html)</a></li>
<li><a href="http://maxima.sourceforge.net/docs/manual/es/maxima.pdf">Manual de referencia en espa&ntilde;ol (pdf)</a></li>
<li><a href="http://www.telefonica.net/web2/biomates/maxima/max.pdf">Tutorial en espa&ntilde;ol "Primeros pasos en Maxima"</a></li>
<li><a href="http://www.telefonica.net/web2/biomates/maxima/gpdraw/">Galer&iacute;a de gr&aacute;ficos</a></li>
<li><a href="http://maxima.sourceforge.net/maximalist.html">Listas de correo para aprender e intercambiar informaci&oacute;n</a></li>
</ul>

<h2>E de que vai Yamwi?</h2>

<p>
Con Yamwi instalado do lado do servidor, ser&aacute; posible facer todo tipo de c&aacute;lculos matem&aacute;ticos e gr&aacute;ficos a trav&eacute;s da <i>web</i>. Adem&aacute;is, o administrador poder&aacute; engadir novos m&oacute;dulos que permitan extender as capacidades de c&aacute;lculo para cubrir necesidades concretas.
</p>

<p>O acceso &aacute;s fontes cvs p&oacute;dese facer dende <a href="http://sourceforge.net/projects/yamwi/develop">Sourceforge</a>. (A&iacute;nda non existe liberaci&oacute;n oficial.)</p>

<p>Hai dous modos de traballo: que os resultados se amosen en formato ASCII ou que se dean con ficheiros binarios feitos con TeX. O administrador pode selecionar un deles despois de feita a instalaci&oacute;n (v&eacute;xase o ficheiro README no arquivo comprimido); por defecto, Yamwi amosa os resultados en formato TeX. 
</p>

<p>
Capturas en modo TeX:
</p>

<center>
<table>
<tr>
<td><a href="cap8.png"><img src="cap8.png" width="100"></a></td>
<td><a href="cap9.png"><img src="cap9.png" width="100"></a></td>
<td><a href="cap10.png"><img src="cap10.png" width="100"></a></td>
<td><a href="cap11.png"><img src="cap11.png" width="100"></a></td>
</tr>
</table>
</center>


<p>
Capturas en modo ASCII Art:
</p>
<center>
<table>
<tr>
<td><a href="cap1.png"><img src="cap1.png" width="100"></a></td>
<td><a href="cap2.png"><img src="cap2.png" width="100"></a></td>
<td><a href="cap3.png"><img src="cap3.png" width="100"></a></td>
<td><a href="cap5.png"><img src="cap5.png" width="100"></a></td>
<td><a href="cap6.png"><img src="cap6.png" width="100"></a></td>
</tr>
</table>
</center>


<p>
Capturas en modo ASCII Art cun tel&eacute;fono m&oacute;bil:
</p>
<center>
<table>
<tr>
<td><a href="cel1.jpg"><img src="cel1.jpg" width="90"></a></td>
<td><a href="cel2.jpg"><img src="cel2.jpg" width="100"></a></td>
</tr>
</table>
</center>


<hr>
<font size="-1" color="green"><i>Mario Rodr&iacute;guez</i></font>

</body>
</html>
