<html>
<head>
<title>Yamwi</title>
</head>

<body>

<p align="right"><a href="index_gl.html">Galego</a> <a href="index.html">English</a></p>


<center>
<h1>Yamwi</h1>
</center>



<p>
Yamwi (<i>Yet Another Maxima Web Interface</i>) es un proyecto consistente en el desarrollo de un interfaz <i>web</i> al <i>Sistema de C&aacute;lculo Simb&oacute;lico</i> Maxima. Dicho interfaz se materializa en un <i>script</i> escrito en <i>php</i>.
</p>

<p>
La instalaci&oacute;n de este interfaz permitir&aacute; el acceso a procedimientos matem&aacute;ticos y gr&aacute;ficos a trav&eacute;s de la rede, tanto en el &aacute;mbito de la ense&ntilde;anza como en el profesional.
</p>

<p>
Yamwi se distribuye con licencia GNU-GPL.
</p>


<hr>

<h2>&iquest;Qu&eacute; es Maxima-CAS?</h2>

<p>
Maxima es un sistema para manipular expresiones simb&oacute;licas y num&eacute;ricas, incluidas la derivaci&oacute;n, integraci&oacute;n, desarrollos de Taylor, transformadas de Laplace, ecuaciones diferenciales ordinarias, sistemas de ecuaciones lineales, polinomios, conjuntos, listas, matrices y tensores. Maxima consigue resultados num&eacute;ricos de alta precisi&oacute;n utilizando fracciones exactas, as&iacute; como enteros y n&uacute;meros decimales de precisi&oacute;n arbitraria. Maxima puede dibujar funciones y datos en dos y tres dimensiones, as&iacute; como componer animaciones.
</p>

<h2>&iquest;Cu&aacute;l es la historia de Maxima?</h2>

<p>
Maxima desciende de Macsyma, el legendario programa de c&aacute;lculo simb&oacute;lico desarrollado a finales de los sesenta en el Instituto Tecnol&oacute;gico de Massachusetts. Macsyma fue revolucionario en su momento, y muchos otros sistemas, como Maple y Mathematica, se inspiraron en &eacute;l.
</p>

<p>
La rama de Macsyma que lleva el nombre de Maxima fue mantenida por William Schelter desde 1982 hasta su fallecimiento en 2001. En 1998 obtuvo permiso del <i>Departamento de Energ&iacute;a</i> para liberar el c&oacute;digo con licencia GNU General Public License (GPL). Fueron sus esfuerzos y conocimientos los que hicieron posible que Maxima sobreviviese.
</p>


<h2>&iquest;Qu&eacute; se necesita para hacer funcionar Maxima?</h2>

<p>
Maxima trabaja sobre Linux, Mac y Windows. Aunque el proyecto centra su atenci&oacute;n en el motor matem&aacute;tico, otros proyectos, varios de ellos alojados tambi&eacute;n en Sourceforge, se dedican al desarrollo de interfaces gr&aacute;ficas de usuario. Desde la p&aacute;gina del proyecto se puede encontrar toda la informaci&oacute;n y los ficheros necesarios.
</p>

<p>
Algunas capturas de pantalla de Maxima trabajando sobre varios entornos:
<ul>
<li><a href="texto.jpg">Texto</a></li>
<li><a href="xmaxima.jpg">Xmaxima</a></li>
<li><a href="texmacs.jpg">Texmacs</a></li>
<li><a href="wxmaxima.jpg">Wxmaxima</a></li>
</ul>
</p>

<h2>&iquest;D&oacute;nde hay informaci&oacute;n sobre Maxima?</h2>

<ul>
<li><a href="http://maxima.sourceforge.net">P&aacute;gina oficial del proyecto</a></li>
<li><a href="http://sourceforge.net/projects/maxima/">P&aacute;gina de Maxima en Sourceforge</a></li>
<li><a href="http://sourceforge.net/project/showfiles.php?group_id=4933">C&oacute;digo fuente y binarios</a></li>
<li><a href="http://maxima.sourceforge.net/docs/manual/es/maxima.html">Manual de referencia en espa&ntilde;ol (html)</a></li>
<li><a href="http://maxima.sourceforge.net/docs/manual/es/maxima.pdf">Manual de referencia en espa&ntilde;ol (pdf)</a></li>
<li><a href="http://www.telefonica.net/web2/biomates/maxima/max.pdf">Tutorial en espa&ntilde;ol "Primeros pasos en Maxima"</a></li>
<li><a href="http://www.telefonica.net/web2/biomates/maxima/gpdraw/">Galer&iacute;a de gr&aacute;ficos</a></li>
<li><a href="http://maxima.sourceforge.net/maximalist.html">Listas de correo para aprender e intercambiar informaci&oacute;n</a></li>
</ul>

<h2>&iquest;Y de qu&eacute; va Yamwi?</h2>

<p>
Con Yamwi instalado del lado del servidor, ser&aacute; posible hacer todo tipo de c&aacute;lculos matem&aacute;ticos y gr&aacute;ficos a trav&eacute;s de la <i>web</i>. Adem&aacute;s, el administrador podr&aacute; a&ntilde;adir nuevos m&oacute;dulos que permitan extender las capacidades de c&aacute;lculo para cubrir necesidades concretas.
</p>

<p>El acceso a las fuentes se puede hacer desde <a href="http://sourceforge.net/projects/yamwi/files" target="_blank">Sourceforge</a>.</p>

<p>Hay dos modos de trabajo: que los resultados se muestren en formato ASCII o que se presenten con ficheros binarios hechos con TeX. El administrador puede seleccionar uno de ellos despu&eacute;s de realizada la instalaci&oacute;n (v&eacute;ase el fichero README del comprimido); por defecto, Yamwi muestra los resultados en formato TeX. 
</p>

<p>
Capturas en modo TeX:
</p>

<center>
<table>
<tr>
<td><a href="cap8.png"><img src="cap8.png" width="100"></a></td>
<td><a href="cap9.png"><img src="cap9.png" width="100"></a></td>
<td><a href="cap10.png"><img src="cap10.png" width="100"></a></td>
<td><a href="cap11.png"><img src="cap11.png" width="100"></a></td>
</tr>
</table>
</center>


<p>
Capturas en modo ASCII Art:
</p>
<center>
<table>
<tr>
<td><a href="cap1.png"><img src="cap1.png" width="100"></a></td>
<td><a href="cap2.png"><img src="cap2.png" width="100"></a></td>
<td><a href="cap3.png"><img src="cap3.png" width="100"></a></td>
<td><a href="cap5.png"><img src="cap5.png" width="100"></a></td>
<td><a href="cap6.png"><img src="cap6.png" width="100"></a></td>
</tr>
</table>
</center>


<p>
Capturas en modo ASCII Art cun tel&eacute;fono m&oacute;vil:
</p>
<center>
<table>
<tr>
<td><a href="cel1.jpg"><img src="cel1.jpg" width="90"></a></td>
<td><a href="cel2.jpg"><img src="cel2.jpg" width="100"></a></td>
</tr>
</table>
</center>



<hr>
<font size="-1" color="green"><i>Mario Rodr&iacute;guez</i></font>

</body>
</html>
